# Weak 8 Pandas 1st Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
s=[4,8,15,16,23,42]
for i in s:
    print(i)

4
8
15
16
23
42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import pandas as pd
var = [1,2,3,4,5,6,7,8,9,10]
pd.Series(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [20]:
data = [['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]
df = pd.DataFrame(data,columns=['Name','Age','Gender'],index=None)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe is a 2d arrangement of data. When we use list with in a list then dataframe will be created.
example:

In [16]:
data={'Name':["karan","Vikas","Sachin"],'Age':[20,22,19]}

In [17]:
df = pd.DataFrame(data)

In [18]:
type(df)

pandas.core.frame.DataFrame

Series is a 1d arrangement of data just like list.
example:

In [21]:
data = [2,4,8,6]
Series = pd.Series(data)

In [22]:
Series
type(Series)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [23]:
data={'Name':["karan","Vikas","Sachin"],'Age':[20,22,19]}
df = pd.DataFrame(data)
df

     Name  Age
0   karan   20
1   Vikas   22
2  Sachin   19

In [25]:
df.shape

(3, 2)

In [26]:
df.describe()

             Age
count   3.000000
mean   20.333333
std     1.527525
min    19.000000
25%    19.500000
50%    20.000000
75%    21.000000
max    22.000000

In [27]:
df.sort_values(by=['Age'])

     Name  Age
2  Sachin   19
0   karan   20
1   Vikas   22

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series:
Homogeneous data
Size Immutable –size cannot be changed
Values of Data Mutable

DataFrame:
Heterogeneous data
Size Mutable
Data Mutable
 
    
Panel:
Heterogeneous data
Size Mutable
Data Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
s1 = pd.Series([10, 20, 30, 40, 50], name="Numbers")
s2 = pd.Series(["apple", "orange", "banana", "grape", "watermelon"], name="Fruits")
df = pd.concat([s1, s2], axis=1)
print(df)

   Numbers      Fruits
0       10       apple
1       20      orange
2       30      banana
3       40       grape
4       50  watermelon